Repository: waheedahmadbhatti/localization_demo
Catalog: lib/l10n/intl_*.arb
Languages: ur

# welcomeTitle
source: Back to Work Collection 2024
ur: 2024 کام کی واپسی کا مجموعہ

# welcomeMessage
source: Indulge in Elegance and Modesty with TryModest! Discover a Stunning Collection of Abayas crafted with Care and Style.
ur: ٹرائے موڈیسٹ کے ساتھ نفاست اور عفت سے لطف اٹھائیں! ہوشیاری اور اسٹائل کے ساتھ تیار کردہ عبایہز کا ایک شاندار مجموعہ دریافت کریں۔

# getStartButtonText
source: Get Started
ur: شروع کریں

# forgotPasswordScreenTitle
source: Forgot Password?
ur: پاس ورڈ بھول گئے؟

# forgotPasswordScreenMessage
source: Oops! Did you forget your password? No worries, we've got your back. Enter your email below, and we'll send you a magic link to reset your password. Stay secure and back to shopping in no time!
ur: آپا! کیا آپ اپنا پاس ورڈ بھول گئے ہیں؟ کوئی پریشانی نہیں، ہماری آپ کی پشت ہے۔ اپنا ای میل ذیل میں درج کریں، اور ہم آپ کو اپنا پاس ورڈ ری سیٹ کرنے کے لیے ایک جادوئی لنک بھیجیں گے۔ محفوظ رہیں اور بغیر کسی وقت دوبارہ خریداری پر جائیں!

# resetPasswordButtonText
source: Reset Password
ur: پاس ورڈ دوبارہ ترتیب دیں

# rememberPasswordText
source: Remember your password?
ur: کیا آپ اپنا پاس ورڈ یاد رکھتے ہیں؟

# passwordResetLinkSentMessage
source: Great news! We've sent a password reset link to your email. Please check your inbox and follow the instructions to reset your password. If you don't see the email, remember to check your spam folder.
ur: شاندار خبر! ہم نے آپ کے ای میل پر پاس ورڈ ری سیٹ لنک بھیج دیا ہے۔ براہ کرم اپنے ان باکس کو چیک کریں اور اپنا پاس ورڈ دوبارہ ترتیب دینے کے لیے ہدایات پر عمل کریں۔ اگر آپ ای میل نہیں دیکھتے ہیں، تو اپنے اسپام فولڈر کو چیک کرنا نہ بھولیں۔

# agreementText
source: By signing up, you agree to our
ur: سائن اپ کرکے، آپ ہماری

# loginScreenTitle
source: Login
ur: داخل

# googleLoginButtonText
source: Sign in with Google
ur: گوگل کے ساتھ سائن ان کریں

# forgotPasswordButtonText
source: Forgot Password?
ur: پاس ورڈ بھول گئے؟

# emailHintText
source: Email
ur: ای میل

# phoneHintText
source: Phone
ur: فون

# passwordHintText
source: Password
ur: پاس ورڈ

# rememberMeText
source: Remember Me
ur: مجھے یاد رکھیں

# orText
source: OR
ur: یا

# dontHaveAnAccountText
source: Don't have an account?
ur: کوئی اکاؤنٹ نہیں ہے؟

# signupScreenTitle
source: Signup
ur: سائن اپ

# loginScreenMessage
source: Welcome back! Please login to access your account.
ur: خوش آمدید واپس! براہ کرم اپنے اکاؤنٹ تک رسائی کے لیے لاگ ان کریں۔

# loginButtonText
source: Login
ur: داخل

# signupButtonText
source: Sign Up
ur: سائن اپ

# firstNameHintText
source: First Name
ur: پہلا نام

# lastnameHintText
source: Last Name
ur: آخری نام

# confirmPasswordHintText
source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

# subscribeToMarketingText
source: Subscribe to our marketing emails
ur: ہمارے مارکیٹنگ ای میلز کو سبسکرائب کریں

# checkoutText
source: Checkout
ur: چیک آؤٹ

# totalTextItemsText
source: Total ({noOfItems}) Items
ur: کل ({noOfItems}) آئٹمز

source: Proceed to Shipping
ur: شپنگ کے لیے آگے بڑھیں

# removeItemText
source: Remove from Cart
ur: کارٹ سے ہٹائیں

# seeProductDetailsText
source: See Product Details
ur: پروڈکٹ کی تفصیلات دیکھیں

source: Order Confirmation
ur: آرڈر کی تصدیق

# successMessage
source: Your order has been successfully placed!
ur: آپ کا آرڈر کامیابی کے ساتھ لگایا گیا ہے!

# taxText
source: Tax
ur: ٹیکس

# subTotalText
source: SubTotal
ur: ذیلی کل

# discountText
source: Discount
ur: کٹوتی

# shippingCostText
source: Shipping Cost
ur: شپنگ کی قیمت

# shippingMethodText
source: Shipping Method
ur: شپنگ کا طریقہ

# gotACouponText
source: Got a Discount Code?
ur: کوئی ڈسکاؤنٹ کوڈ ملا؟

# applyText
source: Apply Coupon
ur: کوپن لگائیں

# removeText
source: Remove
ur: ہٹانا

# changeText
source: Change
ur: تبدیلی

# applyCouponText
source: Apply Discount
ur: ڈسکاؤنٹ لگائیں

# mustSelectShippingAddress
source: You must select a shipping address to be able to choose from shipping options
ur: شپنگ کے اختیارات میں سے انتخاب کرنے کے قابل ہونے کے لیے آپ کو ایک شپنگ ایڈریس منتخب کرنا ہوگا

# proceedToPayText
source: Proceed to Pay
ur: ادا کرنے کے لیے آگے بڑھیں

# selectText
source: Select
ur: منتخب کریں

# shippingAddressText
source: Shipping Address
ur: شپنگ ایڈریس

source: Change
ur: تبدیل کریں

# selectShipppingAddress
source: Select Address
ur: پتہ منتخب کریں

# addShipppingAddress
source: Add Address
ur: پتہ شامل کریں

# shippingAddressMessage
source: Please select a shipping address to proceed with your order. Shipping address information is required for delivery. Thank you for your cooperation.
ur: اپنے آرڈر کے ساتھ آگے بڑھنے کے لیے براہ کرم ایک شپنگ ایڈریس منتخب کریں۔ ترسیل کے لیے شپنگ ایڈریس کی معلومات درکار ہیں۔ آپ کے تعاون کا شکریہ۔

# guestShippingAddressMessage
source: Please provide your shipping address to proceed with your order. Shipping address information is required for delivery. Thank you for your cooperation.
ur: اپنے آرڈر کے ساتھ آگے بڑھنے کے لیے اپنا شپنگ ایڈریس فراہم کریں۔ ترسیل کے لیے شپنگ ایڈریس کی معلومات درکار ہیں۔ آپ کے تعاون کا شکریہ۔

# emptyAddresses
source: It seems you haven't added any addresses yet. Please add a shipping address to proceed with your order. Adding an address ensures smooth delivery of your items. Thank you for your cooperation.
ur: ایسا لگتا ہے کہ آپ نے ابھی تک کوئی پتہ نہیں شامل کیا ہے۔ اپنے آرڈر کے ساتھ آگے بڑھنے کے لیے ایک شپنگ ایڈریس شامل کریں۔ پتہ شامل کرنے سے آپ کی اشیاء کی ترسیل ہموار ہو جاتی ہے۔ آپ کے تعاون کا شکریہ۔

source: Proceed to Billing
ur: بلنگ کے لیے آگے بڑھیں

# completeAddressSelectionMessage
source: Only complete addresses, which must include a city and country, can be selected.
ur: صرف مکمل پتہ منتخب کیے जा सकते हैं, जिनमें شہر اور ملک شامل ہونا چاہیے۔

# newShippingAddressSet
source: This shipping address has set for the delivery!
ur: یہ شپنگ ایڈریس ترسیل کے لیے سیٹ کر دیا گیا ہے!

source: Got it!
ur: سمجھ گیا!

# addAddressScreenTitle
source: Add Address
ur: پتہ شامل کریں

# intuitiveLabelText
source: Help us deliver to the right place! Enter your address details below:
ur: ہمیں صحیح جگہ پر پہنچانے میں مدد کریں! نیچے اپنا پتہ کی تفصیلات درج کریں:

# addressLine1Hint
source: Address Line 1
ur: پتہ کی لائن 1

# addressLine2Hint
source: Address Line 2
ur: پتہ کی لائن 2

# cityHint
source: City
ur: شہر

# zipCodeHint
source: Zip Code
ur: زپ کوڈ

source: Save Shipping Address
ur: شپنگ ایڈریس محفوظ کریں

# saveAddressButton
source: Save Address
ur: پتہ محفوظ کریں

# newAddressAdded
source: Your new address has been added to your account.
ur: آپ کا نیا پتہ آپ کے اکاؤنٹ میں شامل کر دیا گیا ہے۔

# collectionsScreenTitle
source: Collections
ur: مجموعے

# emptyCollectionProductsMessage
source: There are no products available for this collection at the moment. Please check back later.
ur: اس مجموعے کے لیے فی الحال کوئی پروڈکٹ دستیاب نہیں ہیں۔ براہ کرم بعد میں دوبارہ چیک کریں۔

source: About Store
ur: اسٹور کے بارے میں

# homeLabel
source: Home
ur: ہوم

# cartLabel
source: Cart
ur: کارٹ

# collectionsLabel
source: Collections
ur: مجموعے

# profileLabel
source: Profile
ur: پروفائل

# logoutLabel
source: Logout
ur: لاگ آؤٹ

# enterCountryNameText
source: Enter a country name
ur: ملک کا نام درج کریں

# termsText
source: Terms and Conditions
ur: ٹیرمز اور شرائط

# faqsText
source: Frequently Asked Questions
ur: اکثر پوچھے گئے سوالات

# privacyPolicyText
source: Privacy Policy
ur: پرائیویسی پالیسی

# shippingInfoText
source: Shipping and Delivery
ur: شپنگ اور ترسیل

# returnPolicyText
source: Return Policy
ur: واपسی کی پالیسی

# sizeInfoText
source: Size Guide
ur: سائز گائیڈ

source: Accepted Cards
ur: قبول شدہ کارڈز

source: Digital Wallets
ur: ڈیجیٹل والیٹس

# supportedCountries
source: See Countries Supported for Shipping
ur: شپنگ کے لیے معاون ممالک دیکھیں

# categoryText
source: Category
ur: زمرہ

# popularText
source: Popular
ur: مشہور

# viewAllText
source: View All
ur: سب دیکھیں

# searchText
source: Search
ur: تلاش کریں

# refreshText
source: Text Button
ur: ٹیکسٹ بٹن

# swipeUpToRefreshText
source: Swipe Up to Refresh
ur: تازہ کرنے کے لیے اوپر سوائپ کریں

source: Explore Collection
ur: مجموعہ دریافت کریں

# emptyCollectionsMessage
source: No collections available at the moment. Please check back later.
ur: فی الحال کوئی مجموعے دستیاب نہیں ہیں۔ براہ کرم بعد میں دوبارہ چیک کریں۔

# emptyProductsMessage
source: No products available at the moment. Please check back later.
ur: فی الحال کوئی پروڈکٹ دستیاب نہیں ہے۔ براہ کرم بعد میں دوبارہ چیک کریں۔

# emptyOrderStatusMessage
source: There are no orders with this status at the moment. Check back later or explore other tabs.
ur: اس وقت اس حیثیت کے ساتھ کوئی آرڈرز نہیں ہیں۔ بعد میں دوبارہ چیک کریں یا دوسرے ٹیبز تلاش کریں۔

# ordersScreenTitle
source: Orders
ur: آرڈرز

# availableInStockText
source: Available in stock
ur: اسٹاک میں دستیاب

# notAvailableInStockText
source: Out of stock
ur: اسٹاک ختم

# realtedCategories
source: Related Categories
ur: متعلقہ زمرہ جات

# recommendedProductsText
source: Recommended Products
ur: تجویز شدہ مصنوعات

# assertionAtleastOneNonNull
source: One of the product or productId should not be null.
ur: پروڈکٹ یا پروڈکٹ آئی ڈی میں سے ایک نال نہیں ہونا چاہیے۔

# addToCartText
source: Add to Cart
ur: کارٹ میں شامل کریں

# reloadText
source: Try Again
ur: دوبارہ کوشش کریں

# notLoggedInMessage
source: Oops! It looks like you're not logged in. To add items to your cart, please log in or create an account. Happy shopping!
ur: آپ! ایسا لگتا ہے کہ آپ لاگ ان نہیں ہیں۔ اپنی کارٹ میں آئٹمز شامل کرنے کے لیے، براہ کرم لاگ ان کریں یا ایک اکاؤنٹ بنائیں۔ مبارک ہو خریداری!

# greatChoiceTextAddedToCartText
source: Great choice! {productTitle} has been successfully added to your shopping cart!
ur: بہترین انتخاب! {productTitle} آپ کی شاپنگ کارٹ میں کامیابی کے ساتھ شامل کر دیا گیا ہے!

# goToCartText
source: Go to Cart
ur: کارٹ پر جائیں

# productNotFoundMessage
source: The requested product is not found
ur: درخواست شدہ مصنوعات نہیں ملی

# emptyCartMessage
source: Your cart is empty. Discover the latest modest fashion and add your favorite items to the cart!
ur: آپ کی کارٹ خالی ہے۔ جدید ترین سادہ فیشن دریافت کریں اور اپنی پسندیدہ اشیاء کو کارٹ میں شامل کریں!

source: Explore Collections
ur: مجموعے دریافت کریں

# emptySearchProductsMessage
source: No products found. Try refining your search or explore our collections!
ur: کوئی مصنوعات نہیں ملیں۔ اپنی تلاش کو بہتر بنانے کی کوشش کریں یا ہمارے مجموعے دریافت کریں!

# searchHintText
source: Explore Modest Outfits...
ur: سادہ لباس تلاش کریں...

# searchCollectionsHintText
source: Search collections
ur: مجموعے تلاش کریں

# collectionLabel
source: Collection
ur: مجموعہ

# productTypesLabel
source: Product Types
ur: پراڈکٹ کی اقسام

# priceRangeLabel
source: Price Range
ur: قیمت کی حد

# priceMinText
source: Price Min.
ur: کم از کم قیمت۔

# priceMaxText
source: Price Max.
ur: زیادہ سے زیادہ قیمت۔

source: Apply Filters
ur: فلٹرز لگائیں

source: Reset Filters
ur: فلٹرز ری سیٹ کریں

# updateProfileScreenTitle
source: Profile Update
ur: پروفائل کی تازہ کاری

# updateProfileMessage
source: Keep your information up-to-date! Update your profile details below or update the password:
ur: اپنی معلومات کو تازہ رکھیں! اپنی پروفائل کی تفصیلات نیچے دی گئیں یا پاس ورڈ کو اپ ڈیٹ کریں:

# updateProfileText
source: Update Profile
ur: پروفائل کو اپ ڈیٹ کریں

# changePasswordText
source: Change Password
ur: پاس ورڈ تبدیل کریں

# updatedProfile
source: Your profile has been successfully updated!
ur: آپ کا پروفائل کامیابی کے ساتھ اپ ڈیٹ ہو گیا ہے!

# passwordChangeSuccessMessage
source: Your password has been changed successfully. You will now be redirected to the login screen.
ur: آپ کا پاس ورڈ کامیابی کے ساتھ تبدیل کر دیا گیا ہے۔ اب آپ کو لاگ ان اسکرین پر ری ڈائریکٹ کیا جائے گا۔

source: Proceed to Login
ur: لاگ ان کے لیے آگے بڑھیں

# loginText
source: Login
ur: داخل

# signupText
source: Sign Up
ur: سائن اپ

# loginPromptMessage
source: Welcome to a curated collection of modest clothing that celebrates style and comfort. Sign up or log in to explore our exclusive range and enjoy a seamless shopping experience.
ur: آپ کا س迎اگت ہے سادہ لباس کے ایک منظم مجموعے میں جو اسٹائل اور آرام کا جشن مناتا ہے۔ ہماری خصوصی رینج کو دریافت کرنے اور بغیر کسی رکاوٹ کے خریداری کے تجربے سے لطف اندوز ہونے کے لیے سائن اپ کریں یا لاگ ان کریں۔

# welcomeText
source: Welcome
ur: خوش آمدید

# defaultAddressText
source: Default Address
ur: ڈیفالٹ ایڈریس

# changeDefaultText
source: Change Default
ur: ڈیفالٹ تبدیل کریں

# ordersText
source: Orders
ur: آرڈرز

# wishListText
source: Wish List
ur: 願望清單 (Wish List)

source: ordersListBuilder
ur: آرڈر لسٹ بلڈر

# emptyOrdersMessage
source: You haven't placed any orders yet. Start shopping to see your order history!
ur: آپ نے ابھی تک کوئی آرڈر نہیں دیا ہے۔ خریداری شروع کریں اپنی آرڈر کی تاریخ دیکھنے کے لیے!

# emptyWishListMessage
source: Your wishlist is currently empty. Start adding items you love to keep track of them!
ur: آپ کی خواہش کی فہرست فی الحال خالی ہے۔ ان آئٹمز کو شامل کرنا شروع کریں جنہیں

# appName
source: Try Modest
ur: معمولی کوشش کریں۔

# discoverModestFashionWith
source: Discover Modest Fashion with {appTitle}!
ur: {appTitle} کے ساتھ معمولی فیشن دریافت کریں!

source: Why Join?
ur: شامل ہوں کیوں؟

# joinBenefitsFirst
source: 🌟 Access a curated selection of modest fashion
ur: سادہ فیشن کے منظم انتخاب تک رسائی حاصل کریں

# joinBenefitsSecond
source: 🧕🏻 Discover unique styles tailored for you
ur: اپنے لیے بنائے گئے منفرد اسٹائلز دریافت کریں

# joinBenefitsThird
source: 🛒 Enjoy personalized shopping recommendations
ur: ذاتی نوعیت کی خریداری کی سفارشات سے لطف اندوز ہوں

# getStarted
source: Get Started Today!
ur: آج ہی شروع کریں!

# alreadyMember
source: Already a member? Log in here
ur: پہلے سے ہی رکن ہیں؟ یہاں لاگ ان کریں

# joinCommunity
source: Join Our Modest Community
ur: ہمارے سادہ کمیونٹی میں شامل ہوں

# termsAndPrivacy
source: By signing up, you agree to our Terms of Service and Privacy Policy.
ur: سائن اپ کرکے، آپ ہماری سروس کی شرائط اور پرائیویسی پالیسی سے اتفاق کرتے ہیں۔

# experienceFashion
source: Experience Fashion, Redefined.
ur: فیشن کا تجربہ کریں، نئے سرے سے متعارف کرایا گیا۔

# allAddressesText
source: All of your addresses,
ur: آپ کے تمام پتے,

# makeDefaultText
source: Make Default
ur: ڈیفالٹ بنائیں

# newAddressText
source: New Address
ur: نیا پتہ

# removeAddressText
source: Remove Address
ur: پتہ ہٹائیں

# maxAddressesText
source: Max 10 Addresses Allowed
ur: زیادہ سے زیادہ 10 پتے کی اجازت ہے

# changePasswordScreenTitle
source: Change Password
ur: پاس ورڈ تبدیل کریں

# changePasswordScreenMessage
source: Welcome back! Please login to access your account.
ur: خوش آمدید واپس! براہ کرم اپنے اکاؤنٹ تک رسائی کے لیے لاگ ان کریں۔

# settingsText
source: Settings
ur: ترتیبات

# openText
source: Open
ur: کھلا

# archivedText
source: Archived
ur: محفوظ شدہ

# canceledText
source: Canceled
ur: منسوخ

# anyText
source: Any
ur: کوئی

# closedText
source: Closed
ur: بند

# pendingText
source: Pending
ur: رقمے میں

# authorizedText
source: Authorized
ur: مجاز

# overdueText
source: Overdue
ur: ميعاد ختم

# expiringText
source: Expiring
ur: ختم ہونے والا

# expiredText
source: Expired
ur: ختم شدہ

# paidText
source: Paid
ur: ادا شدہ

# refundedText
source: Refunded
ur: واپسی

# partiallyRefundedText
source: Partially Refunded
ur: جزوی واپسی

# partiallyPaidText
source: Partially Paid
ur: جزوی ادائیگی

# voidedText
source: Voided
ur: منسوخ شدہ

# unpaidText
source: Unpaid
ur: غیر ادا شدہ

# fulfilledText
source: Fulfilled
ur: پورا شدہ

# unfulfilledText
source: Unfulfilled
ur: نامکمل

# partiallyFulfilledText
source: Partially Fulfilled
ur: جزوی طور پر پورا شدہ

# scheduledText
source: Scheduled
ur: شیڈول شدہ

# onHoldText
source: On Hold
ur: ہولڈ پر

# allText
source: All
ur: سب

# processingOrderText
source: Processing Ordered
ur: پراسیسنگ آرڈر

# shippedText
source: Shipped
ur: بھیجا گیا

# toPayText
source: To Pay
ur: ادا کرنے کے لیے
